# 定数ファイル

# データベースのディレクトリ指定パス
dbpath = "db.sqlite3"

# 大カテゴリ参照用定数
primary_category_number_1 = "経営・企業法務"
primary_category_number_2 = "融資・助成金・補助金"
primary_category_number_3 = "労務・労働雇用"
primary_category_number_4 = "行政手続き"

# 小カテゴリ参照用定数
part_category_number_1 = [
  [1,"契約書の作成・確認"],
  [2,"紛争・訴訟対応"],
  [3,"法令順守・法令調査"],
  [4,"会社法"],
  [5,"知的財産権"],
  [6,"債権回収"],
  [7,"M＆A"],
  [8,"事業承継"],
  [9,"法人破産"],
  [10,"経営再建・事業再生"],
  [11,"予防法務"],
  [12,"クレーム対応"],
  [13,"契約トラブル"],
  [14,"情報漏洩"],
  [15,"風評被害"],
  [16,"企業経営セカンドオピニオン"],
  [17,"企業買収"],
  [18,"IPO・株式上場"],
  [19,"社内不正事実の調査・検証"],
  [20,"法人保険"]
]

part_category_number_2 = [
  [21,"資金繰り・融資全般"],
  [22,"キャリアアップ助成金"],
  [23,"IT導入補助金"],
  [24,"起業・創業支援"],
  [25,"事業計画書の作成"],
  [26,"小規模事業者持続化補助金"],
  [27,"ものづくり・商業・サービス生産性向上促進補助金"],
  [28,"事業承継・引継ぎ補助金"],
  [29,"事業再構築補助金"],
  [30,"人材確保等支援助成金"],
  [31,"中途採用等支援助成金"],
  [32,"補助金・助成金全般"],
  [33,"ビジネスローン"],
  [34,"新型コロナ関連の給付金・助成金・補助金"]
]

part_category_number_3 = [
  [35,"パワハラ・セクハラ"],
  [36,"残業代被請求"],
  [37,"就業規則"],
  [38,"社内規程の作成・改定"],
  [39,"労災保険"],
  [40,"社会保険"],
  [41,"問題社員の懲戒解雇"],
  [42,"労働組合・団体交渉"],
  [43,"労働審判・労働訴訟"],
  [44,"採用・内定取り消し"],
  [45,"退職勧奨"],
  [46,"就業規則の見直し"],
  [47,"雇用保険"],
  [48,"福利厚生"]
]

part_category_number_4 = [
  [49,"許認可"],
  [50,"特許取得"],
  [51,"決算処理・決算対策"],
  [52,"確定申告"],
  [53,"法人税申告"],
  [54,"税務調査"],
  [55,"決算処理"],
  [56,"登記申請"],
  [57,"不動産登記"],
  [58,"税務代理・税務相談"],
  [59,"在留資格(ビザ)の申請"],
  [60,"定款の見直し・改定"],
  [61,"飲食店などの開業手続き"],
  [62,"自動車関連の手続き"],
  [63,"産業廃棄物許可"],
  [64,"相続関連"],
  [65,"海外進出"],
  [66,"節税"],
  [67,"年末調整"]
]